# Pandas
* ### Pandas is an open source library built on the top of numpy
* ### It allows for fast analysis,data cleaning and preparation.
* ### It can work with data from variety of sources.

## Discussion Topics
* #### Series
* #### Dataframe
* #### Missing Data
* #### Groupby
* #### Merging,joining and concatenation
* #### Basic operations

##### So let's get started

In [1]:
import numpy as np
from numpy.random import randn
import pandas as pd

In [3]:
labels = ['a','b','c']
arr = [10,20,30]
my_data = np.array(arr)
d = {'1':4,'2':5,'3':6}

In [5]:
arr

[10, 20, 30]

In [9]:
my_data

array([10, 20, 30])

In [10]:
pd.Series(data=(1,2,3),index = ('a','b','c'))

a    1
b    2
c    3
dtype: int64

In [11]:
pd.Series(data=(1,2,3),index = (arr))

10    1
20    2
30    3
dtype: int64

In [12]:
pd.Series(data=my_data,index = labels)

a    10
b    20
c    30
dtype: int32

In [13]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int32

In [14]:
pd.Series(labels,d)

1    a
2    b
3    c
dtype: object

In [15]:
pd.Series(d,labels)

a   NaN
b   NaN
c   NaN
dtype: float64

In [16]:
d

{'1': 4, '2': 5, '3': 6}

In [17]:
#np.random.seed(101)

#### Dataframe

In [18]:
df = pd.DataFrame(randn(4,5),['a','b','c','d'],['w','x','y','z','n'])

In [19]:
df

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441
b  0.329706  0.271461  1.287066  0.427041 -0.650417
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205

In [20]:
type(df['w'])

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df[['w','x','y']]

          w         x         y
a  0.758702 -0.970306  1.693175
b  0.329706  0.271461  1.287066
c -1.632115 -0.277284 -0.897973
d -0.229845 -0.687309 -0.023576

In [23]:
df.w

a    0.758702
b    0.329706
c   -1.632115
d   -0.229845
Name: w, dtype: float64

In [24]:
df['new'] = df['w']

In [25]:
df

          w         x         y         z         n       new
a  0.758702 -0.970306  1.693175 -0.972061  0.475441  0.758702
b  0.329706  0.271461  1.287066  0.427041 -0.650417  0.329706
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361 -1.632115
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205 -0.229845

In [26]:
df.drop('new',axis = 1)

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441
b  0.329706  0.271461  1.287066  0.427041 -0.650417
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205

In [27]:
df.shape

(4, 6)

In [28]:
df

          w         x         y         z         n       new
a  0.758702 -0.970306  1.693175 -0.972061  0.475441  0.758702
b  0.329706  0.271461  1.287066  0.427041 -0.650417  0.329706
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361 -1.632115
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205 -0.229845

In [29]:
df.shape

(4, 6)

In [30]:
df.drop('new',axis = 1)

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441
b  0.329706  0.271461  1.287066  0.427041 -0.650417
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205

In [31]:
df

          w         x         y         z         n       new
a  0.758702 -0.970306  1.693175 -0.972061  0.475441  0.758702
b  0.329706  0.271461  1.287066  0.427041 -0.650417  0.329706
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361 -1.632115
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205 -0.229845

In [32]:
df = df.drop('new',axis = 1)

In [33]:
df

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441
b  0.329706  0.271461  1.287066  0.427041 -0.650417
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205

In [34]:
df.loc['c']

w   -1.632115
x   -0.277284
y   -0.897973
z    1.459214
n   -1.546361
Name: c, dtype: float64

In [35]:
df.iloc[2]   #index based location

w   -1.632115
x   -0.277284
y   -0.897973
z    1.459214
n   -1.546361
Name: c, dtype: float64

In [36]:
df.loc['b','y']

1.2870655211901858

In [37]:
df.loc[['b','c'],['y','z']]

          y         z
b  1.287066  0.427041
c -0.897973  1.459214

### Data frame continued

In [38]:
df

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441
b  0.329706  0.271461  1.287066  0.427041 -0.650417
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205

In [39]:
df>0

       w      x      y      z      n
a   True  False   True  False   True
b   True   True   True   True  False
c  False  False  False   True  False
d  False  False  False  False  False

In [40]:
df['w']>0

a     True
b     True
c    False
d    False
Name: w, dtype: bool

In [41]:
df

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441
b  0.329706  0.271461  1.287066  0.427041 -0.650417
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205

In [42]:
df[df['w']>0]

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441
b  0.329706  0.271461  1.287066  0.427041 -0.650417

In [43]:
df[df['w']>0]['x']

a   -0.970306
b    0.271461
Name: x, dtype: float64

In [44]:
df[df['w']>0][['x','y','z']]

          x         y         z
a -0.970306  1.693175 -0.972061
b  0.271461  1.287066  0.427041

In [62]:
check= df['w']>0           #broken into many steps
result = df[check]
columns = ['x','y','z']
newdf = result[columns]
newdf

          x         y         z
a -0.970306  1.693175 -0.972061
b  0.271461  1.287066  0.427041

In [45]:
booldf = df>0

In [46]:
booldf

       w      x      y      z      n
a   True  False   True  False   True
b   True   True   True   True  False
c  False  False  False   True  False
d  False  False  False  False  False

In [47]:
df[booldf]

          w         x         y         z         n
a  0.758702       NaN  1.693175       NaN  0.475441
b  0.329706  0.271461  1.287066  0.427041       NaN
c       NaN       NaN       NaN  1.459214       NaN
d       NaN       NaN       NaN       NaN       NaN

In [56]:
df['w']>0

a     True
b     True
c    False
d    False
Name: w, dtype: bool

In [53]:
df[df['w']>0]  #conditional selection

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441
b  0.329706  0.271461  1.287066  0.427041 -0.650417

In [63]:
df[(df['w']>0) & (df['x']<0)]    #multiple conditions

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441

In [64]:
df[(df['w']>0) | (df['x']<0)]

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441
b  0.329706  0.271461  1.287066  0.427041 -0.650417
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205

In [68]:
a = df.reset_index()

In [69]:
a

  index         w         x         y         z         n
0     a  0.758702 -0.970306  1.693175 -0.972061  0.475441
1     b  0.329706  0.271461  1.287066  0.427041 -0.650417
2     c -1.632115 -0.277284 -0.897973  1.459214 -1.546361
3     d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205

In [70]:
df

          w         x         y         z         n
a  0.758702 -0.970306  1.693175 -0.972061  0.475441
b  0.329706  0.271461  1.287066  0.427041 -0.650417
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205

In [74]:
newlist = '1 2 3 4'.split()

In [75]:
newlist

['1', '2', '3', '4']

In [80]:
df['SN'] = newlist

In [81]:
df

          w         x         y         z         n  s SN
a  0.758702 -0.970306  1.693175 -0.972061  0.475441  1  1
b  0.329706  0.271461  1.287066  0.427041 -0.650417  2  2
c -1.632115 -0.277284 -0.897973  1.459214 -1.546361  3  3
d -0.229845 -0.687309 -0.023576 -2.320019 -0.077205  4  4

In [86]:
df.set_index('SN')

           w         x         y         z         n  s
SN
1   0.758702 -0.970306  1.693175 -0.972061  0.475441  1
2   0.329706  0.271461  1.287066  0.427041 -0.650417  2
3  -1.632115 -0.277284 -0.897973  1.459214 -1.546361  3
4  -0.229845 -0.687309 -0.023576 -2.320019 -0.077205  4

In [90]:
df.drop('s',axis =1,inplace = True)

In [92]:
df.set_index('SN',inplace = True)

In [93]:
df

           w         x         y         z         n
SN
1   0.758702 -0.970306  1.693175 -0.972061  0.475441
2   0.329706  0.271461  1.287066  0.427041 -0.650417
3  -1.632115 -0.277284 -0.897973  1.459214 -1.546361
4  -0.229845 -0.687309 -0.023576 -2.320019 -0.077205

In [97]:
df.shape

(4, 5)

# MultiIndex

In [3]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [4]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [5]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -1.056643 -0.950802
   2  0.031227  0.518776
   3  1.840526  0.721963
G2 1 -0.055842 -0.886782
   2  0.628446 -1.373265
   3 -3.182054 -0.626727

In [6]:
df.loc['G1']

          A         B
1 -1.056643 -0.950802
2  0.031227  0.518776
3  1.840526  0.721963

In [7]:
df.loc['G1'].loc[1]

A   -1.056643
B   -0.950802
Name: 1, dtype: float64

In [8]:
df.index.names

FrozenList([None, None])

In [10]:
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1   -1.056643 -0.950802
      2    0.031227  0.518776
      3    1.840526  0.721963
G2    1   -0.055842 -0.886782
      2    0.628446 -1.373265
      3   -3.182054 -0.626727

In [11]:
df.xs('G1')

            A         B
Num
1   -1.056643 -0.950802
2    0.031227  0.518776
3    1.840526  0.721963

In [12]:
df.xs(['G1',1])

A   -1.056643
B   -0.950802
Name: (G1, 1), dtype: float64

In [13]:
df.xs(1,level='Num')

              A         B
Group
G1    -1.056643 -0.950802
G2    -0.055842 -0.886782

## Missing data

In [14]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [15]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [16]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [17]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [18]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [19]:
df.fillna(value='VALUE')

       A      B  C
0      1      5  1
1      2  VALUE  2
2  VALUE  VALUE  3

In [20]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby

In [21]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [23]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

#### Now you can use the .groupby() method to group rows together based off of a column name.

In [24]:
df.groupby('Company')

In [25]:
by_comp = df.groupby("Company")

In [26]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [27]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [28]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [29]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [30]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [31]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [32]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

#### Merging joining and concatenation

In [33]:
# dataframes

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [34]:
# concatenation

pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [35]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [36]:
#Dataframes

left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

#### Merging

In [37]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [38]:
# more complicated example
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [39]:
pd.merge(left, right, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [40]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [41]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [42]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

#### joining

In [43]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [44]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [45]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

##### Pivot table

In [53]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [54]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN